/****************************************************************************
* 文件名：main.c
* 功  能：LED控制。对D9 LED-RED进行控制，采用软件延时方法。
*         使用I/O口直接控制，采用灌电流方式。
* 说  明：将跳线器JP22短接，JP20断开。
****************************************************************************/
#include  "config.h"
#define   LEDCON  0x000000c0   // P0.7引脚控制D9，低电平亮


/****************************************************************************
* 名    称：DelayNS()
* 功    能：长软件延时。
* 入口参数：dly		延时参数，值越大，延时越久
* 出口参数：无
****************************************************************************/
void  DelayNS(uint32  dly)
{   
	uint32  i;
    for(; dly>0; dly--) 
    {
        for(i=0; i<50000; i++);
    }
}

/****************************************************************************
* 名    称：main()
* 功    能：控制LED灯闪烁。
****************************************************************************/
int  main(void)
{
     PINSEL0=0                    ;      	// 设置管脚连接模块连接至GPIO   
     IO0DIR=LEDCON                    ;       	// 设置LEDCON IO口为输出方式

    while(1)	
    {  
        IO0SET=LEDCON;    	// LEDCON = 0 
        DelayNS(10);			// 延时
        IO0CLR=LEDCON;    	// LEDCON = 1
        DelayNS(10);			// 延时
    }
    return(0);
}
