/****************************************************************************
* 文 件 名：main.c
* 功    能：读取I/O引脚值，并输出控制LED
*           使用I/O口输入方式对P0.20口进行扫描，对LED控制。
* 说    明：按动KEY1按键观察LED效果。
****************************************************************************/
#include  "config.h"
#define	  LEDCON	1<<7     		// P0.7引脚控制B1，低电平LED亮
#define   KEY       1<<20	        // 定义按键

/****************************************************************************
* 名    称：main()
* 功    能：读取P0.20口的值，并输出控制红色LED灯 D9。
****************************************************************************/
int  main(void)
{  
	uint32  keystate = 0;

    PINSEL0 = 0x00000000;		    // 设置管脚连接GPIO
    PINSEL1 = 0x00000000;		    // 设置管脚连接GPIO   
    IO0DIR = LEDCON;			    // 设置B1控制口为输出，其它I/O为输入
    
    while(1)
    {  	
    	if( (IO0PIN&KEY)!=0 ) 
    	{
    		if(keystate)
    		{
    			IO0CLR = LEDCON;
    			keystate = 0;
    		}
    		else
    		{    			
    			IO0SET = LEDCON;
    			keystate = 1;
    		}
    	    while((IO0PIN&KEY)!=0);
    	}         			
	}
    return(0);
}

