/****************************************************************************
* 文 件 名：main.c
* 功    能：使用定时器0和定时器1实现1秒定时,控制绿色LED灯亮灭。(中断方式)
* 说    明：JP22跳线短接，JP20跳线断开。  
****************************************************************************/
#include  "config.h"
#define	  G_LEDCON  1<<7			            // P0.7引脚控制D9，低电平亮


void  Time1Init(void);
/****************************************************************************
* 名    称：IRQ_Time0()
* 功    能：定时器0中断服务程序，取反G_LEDCON控制口。
* 入口参数：无
* 出口参数：无
****************************************************************************/
void __irq  IRQ_Time0(void)
{     
    IO0CLR = G_LEDCON;	        	
    T0IR = 0x01;	 			            // 清除中断标志
    VICVectAddr = 0x00;			            // 通知VIC中断处理结束
}






/****************************************************************************
* 名    称：IRQ_Time1()
* 功    能：定时器1中断服务程序，取反G_LEDCON控制口。
* 入口参数：无
* 出口参数：无
****************************************************************************/
void __irq  IRQ_Time1(void)
{     	    
   	IO0SET = G_LEDCON;     
    T1IR = 0x01;	 			            // 清除中断标志
    VICVectAddr = 0x00;			            // 通知VIC中断处理结束
}

/****************************************************************************
* 名    称：Time1Init()
* 功    能：初始化定时器0，定时时间为1S，并使能中断。   00100100
* 入口参数：无
* 出口参数：无
****************************************************************************/
void  Time1Init(void)
{   /* Fcclk = Fosc*4 = 11.0592MHz*4 = 44.2368MHz
	   Fpclk = Fcclk/4 = 44.2368MHz/4 = 11.0592MHz
	*/
	
	T1PR = 99;			    	    		// 设置定时器1分频为100分频，得110592Hz
	T1MCR = 0x03;		   					// 匹配通道0匹配中断并复位T1TC
	T1MR0 = 110591;	    					// 比较值(1S定时值)
	T1TCR = 0x03;		   					// 启动并复位T1TC
	
	/* 设置定时器0中断IRQ */
	VICIntSelect = 0x00;					// 所有中断通道设置为IRQ中断
	VICVectCntl1 = 0x25;					// 定时器1中断通道分配最高优先级(向量控制器1)
	VICVectAddr1 = (uint32)IRQ_Time1; 		// 设置中断服务程序地址向量 
	VICIntEnable = 0x00000020;				// 使能定时器1中断
}




/****************************************************************************
* 名    称：Time0Init()
* 功    能：初始化定时器0，定时时间为1S，并使能中断。 
* 入口参数：无
* 出口参数：无
****************************************************************************/
void  Time0Init(void)
{   	
	T0PR = 99;			    	    		// 设置定时器0分频为100分频，得110592Hz
	T0MCR = 0x03;		   					// 匹配通道0匹配中断并复位T0TC
	T0MR0 = 110591;	    					// 比较值(1S定时值)
	T0TCR = 0x03;		   					// 启动并复位T0TC
	T0TCR = 0x01; 
	
	/* 设置定时器0中断IRQ */
	VICIntSelect = 0x00;					// 所有中断通道设置为IRQ中断
	VICVectCntl0 = 0x24;					// 定时器0中断通道分配最高优先级(向量控制器0)
	VICVectAddr0 = (uint32)IRQ_Time0; 		// 设置中断服务程序地址向量 
	VICIntEnable = 0x00000010;				// 使能定时器0中断
}




/****************************************************************************
* 名   称：main()
* 功   能：初始化I/O及定时器，然后等待中断。 
****************************************************************************/
int  main(void)
{  
	int flag =1;
	IRQEnable();
    PINSEL0 = 0x00000000;					// 设置管脚连接GPIO   
    IO0DIR = G_LEDCON; 						// 设置I/O为输出
    Time0Init();							// 初始化定时器0及使能中断
    Time1Init();                           // 初始化定时器1及使能中断
    while(1)                               // 等待定时器0中断或定时器1匹配输出
    {
    	if((T0TC>=55295) && ( flag==1))
    		{
    			T1TCR = 0x01;
    			flag=2;
    		}
    }			
   				
   
    return(0);
}
