/****************************************************************************
* 文 件 名：main.c
* 功    能：LED显示控制。
*           通过GPIO直接控制8个LED产生流水灯效果
* 说    明：
*           这个警告可忽略，C2892E: signed constant overflow
****************************************************************************/
#include  "config.h"
#define   LEDCON	0x00ff0000


/****************************************************************************
* 名    称：DelayNS()
* 功    能：长软件延时
* 入口参数：dly		延时参数，值越大，延时越久
* 出口参数：无
****************************************************************************/
void  DelayNS(uint32  dly)
{   uint32  i;

    for(; dly>0; dly--) 
    {
        for(i=0; i<50000; i++);
    }
}
                      
/****************************************************************************
* 名    称：main()
* 功    能：根据表DISP_TAB来控制LED显示。
****************************************************************************/
int  main(void)
{   
    int8 i; 		
    
    /* PINSEL1使用启动代码的默认配置*/ 
    IO1DIR = LEDCON;    	        // 配置LED控制I/O方向
      
    while(1)	
    {  
    
    	for(i=0; i<8; i++)
        {  
            IO1CLR = 1<<(16+i);   // 输出LED显示数据
            DelayNS(20);	        // 延时
            IO1SET = 0xffffffff;
        } 

    }
    
    return(0);
}