/****************************************************************************
* 文 件 名：main.c
* 功    能：使用定时器0实现1秒定时,控制绿色LED灯管亮。(查询方式)
* 说    明：JP22跳线短接，JP20跳线断开。
****************************************************************************/
#include  "config.h"
#define	  G_LEDCON  1<<7							// P0.7引脚控制D9，低电平亮

/****************************************************************************
* 名    称：Time0Init()
* 功    能：初始化定时器0，定时时间为1S。 
* 入口参数：无
* 出口参数：无
****************************************************************************/
void  Time0Init(void)
{   
    T0PR = 99;			    					// 设置定时器0分频为100分频，得110592Hz
	T0MCR = 0x03;		   						// 匹配通道0匹配中断并复位T0TC
	T0MR0 = 110591;	    						// 比较值(1S定时值)
	T0TCR = 0x03;		   						// 启动并复位T0TC
	T0TCR = 0x01; 
}

/****************************************************************************
* 名    称：main()
* 功    能：初始化I/O及定时器，然后不断的查询定时器中断标志。当定时时间到达时，取反G_LEDCON
*           控制口。
****************************************************************************/
int  main(void)
{  
	int LEDstate = 0;
    PINSEL0 = 0x00000000;						// 设置管脚连接GPIO   
    IO0DIR = G_LEDCON; 							// 设置I/O为输出
    Time0Init();								// 初始化定时器0	
   		
    while(1)	
    {  
        while( (T0IR&0x01) == 0 );			    // 等待定时时间到
        T0IR = 0x01;                            // 清除中断标志 
        
        LEDstate=(LEDstate+1)%3;		         					
       
        if( LEDstate == 0 )                     //led灯亮2秒，灭1秒
        {
            IO0SET = G_LEDCON;	
        }
        else  
        {
            IO0CLR = G_LEDCON;	
        }					
   }
   return(0);
}
