/****************************************************************************
* 文 件 名：main.c
* 功    能：使用定时器0实现0.5秒定时,控制绿色LED灯亮。(查询方式)
* 说    明：JP22跳线短接，JP20跳线断开。
****************************************************************************/
#include  "config.h"
#define	  G_LEDCON  1<<7							// P0.7引脚控制D9，低电平亮

/****************************************************************************
* 名    称：Time0Init()
* 功    能：初始化定时器0，定时时间为1S。 
* 入口参数：无
* 出口参数：无
****************************************************************************/
void  Time0Init(void)
{   /* Fcclk = Fosc*4 = 11.0592MHz*4 = 44.2368MHz
	   Fpclk = Fcclk/4 = 44.2368MHz/4 = 11.0592MHz
	*/
    T0PR = 99;			    					// 设置定时器0分频为100分频，得110592Hz
	T0MCR = 0x10;		   						// 匹配通道1匹配中断并复位T0TC
	T0EMR =0xc0;
	T0MR1 = 55296;	    						// 比较值(1S定时值)
	T0TCR = 0x03;		   						// 启动并复位T0TC
	T0TCR = 0x01; 
}

/****************************************************************************
* 名    称：main()
* 功    能：初始化I/O及定时器，然后不断的查询定时器中断标志。当定时时间到达时，取反BEEPCON
*           控制口。
****************************************************************************/
int  main(void)
{  
    PINSEL1 = 3<<22;						// 设置管脚连接GPIO   
    Time0Init();								// 初始化定时器0	
   		
    while(1);	

   return(0);
}
